Repository: SardorAllaberganov/water_buddy
Catalog: WaterBuddy/Localizable.xcstrings
Source language: en
Languages: ru, uz

source: %1$@, add %2$d millilitres
ru: %1$@, добавить %2$d миллилитров
uz: %1$@, %2$d millilitr qo‘shish

source: %1$d / %2$d ml
ru: %1$d / %2$d мл

source: %1$d millilitres
ru: %1$d миллилитров
uz: %1$d millilitr

source: %1$d ml
ru: %1$d мл

source: %1$d of %2$d millilitres
ru: %1$d из %2$d миллилитров
uz: %2$d millilitrdan %1$d

source: %1$d of %2$d ml
ru: %1$d из %2$d мл
uz: %2$d dan %1$d ml

source: %1$d percent. %2$d of %3$d millilitres.
ru: %1$d процентов. %2$d из %3$d миллилитров.
uz: %1$d foiz. %3$d millilitrdan %2$d.

source: +%1$d ml
ru: +%1$d мл

source: A glass now keeps you on track for the day.
ru: Стакан сейчас — и день пройдёт по плану.
uz: Hozir bir stakan — kun rejada davom etadi.

source: A nudge every two hours from 9 AM to 9 PM, skipped if you drank in the hour before it. Reaching your goal silences the rest of the day.
ru: Напоминание каждые два часа с 9:00 до 21:00. Оно пропускается, если за час до него вы пили воду. Достижение цели отключает остальные напоминания до конца дня.
uz: 9:00 dan 21:00 gacha har ikki soatda eslatma. Undan oldingi bir soat ichida suv ichgan bo‘lsangiz, u o‘tkazib yuboriladi. Maqsadga erishilsa, kun oxirigacha eslatmalar to‘xtaydi.

source: A nudge every two hours from 9 AM to 9 PM, unless you drank in the hour before it or have already reached your goal. Your notification summary is on, so reminders may arrive in a batch rather than on the hour.
ru: Напоминание каждые два часа с 9:00 до 21:00, если цель ещё не достигнута и вы не пили воду за час до него. У вас включена сводка уведомлений, поэтому напоминания могут приходить пачкой, а не точно по часам.
uz: 9:00 dan 21:00 gacha har ikki soatda eslatma, agar maqsadga hali erishmagan va undan oldingi bir soat ichida suv ichmagan bo‘lsangiz. Bildirishnomalar jamlanmasi yoqilgan, shuning uchun eslatmalar soat sayin emas, to‘plam bo‘lib kelishi mumkin.

source: Add %1$d millilitres
ru: Добавить %1$d миллилитров
uz: %1$d millilitr qo‘shish

source: Add a serving
ru: Добавить порцию
uz: Porsiya qo‘shish

source: Adds your Glass to today's total in WaterBuddy.
ru: Добавляет ваш стакан к сегодняшнему итогу в WaterBuddy.
uz: WaterBuddy’dagi bugungi umumiy hisobga stakaningizni qo‘shadi.

source: Average %1$d millilitres. Best %2$d millilitres.
ru: В среднем %1$d миллилитров. Лучший день %2$d миллилитров.
uz: O‘rtacha %1$d millilitr. Eng yaxshi kun %2$d millilitr.

source: Average %1$d ml
ru: В среднем %1$d мл
uz: O‘rtacha %1$d ml

source: Best %1$d ml
ru: Лучший %1$d мл
uz: Eng yaxshi %1$d ml

source: Bottle
ru: Бутылка
uz: Shisha

source: Cancel
ru: Отмена
uz: Bekor qilish

source: Cup
ru: Чашка
uz: Chashka

source: Daily goal
ru: Дневная цель
uz: Kunlik maqsad

source: Daily water goal
ru: Дневная норма воды
uz: Kunlik suv maqsadi

source: Delete
ru: Удалить
uz: O‘chirish

source: Edit serving
ru: Изменить порцию
uz: Porsiyani tahrirlash

source: Edits this serving
ru: Изменяет эту порцию
uz: Bu porsiyani tahrirlaydi

source: Follow device
ru: Как на устройстве
uz: Qurilmadagidek

source: Get Started
ru: Начать
uz: Boshlash

source: Glass
ru: Стакан
uz: Stakan

source: History
ru: История
uz: Tarix

source: Home
ru: Главная
uz: Bosh sahifa

source: How much water do you want to drink each day?
ru: Сколько воды вы хотите выпивать каждый день?
uz: Har kuni qancha suv ichmoqchisiz?

source: Hydration
ru: Гидратация
uz: Suv iste’moli

source: Language
ru: Язык
uz: Til

source: Last %1$d days
ru: Последние %1$d дней
uz: Oxirgi %1$d kun

source: Log a Glass
ru: Записать стакан
uz: Stakanni qayd etish

source: Measured against your current goal
ru: Сравнивается с текущей целью
uz: Joriy maqsadingizga nisbatan

source: Nothing logged that day
ru: В этот день ничего не записано
uz: Bu kuni hech narsa qayd etilmagan

source: Nothing logged yet today
ru: Сегодня ещё ничего не записано
uz: Bugun hali hech narsa qayd etilmagan

source: Notifications are turned off for WaterBuddy in iOS Settings, so reminders can't be delivered.
ru: Уведомления для WaterBuddy отключены в настройках iOS, поэтому напоминания не будут приходить.
uz: WaterBuddy uchun bildirishnomalar iOS sozlamalarida o‘chirilgan, shuning uchun eslatmalar yetkazilmaydi.

source: Open iOS Settings
ru: Открыть настройки iOS
uz: iOS sozlamalarini ochish

source: Pick a vessel on the Home tab to log your first serving.
ru: Выберите сосуд на вкладке «Главная», чтобы записать первую порцию.
uz: Birinchi porsiyani qayd etish uchun «Bosh sahifa» bo‘limidan idish tanlang.

source: Quick-add vessels
ru: Быстрые порции
uz: Tez qo‘shish idishlari

source: Reminds you to drink every two hours between 9 AM and 9 PM
ru: Напоминает пить каждые два часа с 9:00 до 21:00
uz: 9:00 dan 21:00 gacha har ikki soatda suv ichishni eslatadi

source: Save
ru: Сохранить
uz: Saqlash

source: Serving amount
ru: Объём порции
uz: Porsiya hajmi

source: Settings
ru: Настройки
uz: Sozlamalar

source: Smart reminders
ru: Умные напоминания
uz: Aqlli eslatmalar

source: Tap + to add a serving you forgot.
ru: Коснитесь «+», чтобы добавить забытую порцию.
uz: Unutilgan porsiyani qo‘shish uchun «+» tugmasini bosing.

source: The app switches straight away. The widget follows on its next refresh.
ru: Приложение переключится сразу. Виджет — при следующем обновлении.
uz: Ilova darhol almashadi. Vidjet keyingi yangilanishda o‘zgaradi.

source: The middle vessel is the one your widget logs.
ru: Средняя порция — та, что записывает виджет.
uz: O‘rtadagi idish — vidjet yozadigan porsiya.

source: Time for water
ru: Время попить воды
uz: Suv ichish vaqti

source: Today
ru: Сегодня
uz: Bugun

source: Today's hydration
ru: Потребление воды сегодня
uz: Bugungi suv iste’moli

source: Track today's hydration and log a glass without opening the app.
ru: Следите за потреблением воды и записывайте стакан, не открывая приложение.
uz: Ilovani ochmasdan suv iste’molini kuzating va stakan qayd eting.

source: Water logged.
ru: Вода записана.
uz: Suv qayd etildi.

source: Welcome to
ru: Добро пожаловать в
uz: Xush kelibsiz

source: When
ru: Когда
uz: Qachon

source: You can change this later in Settings.
ru: Это можно изменить позже в настройках.
uz: Buni keyinroq Sozlamalarda o‘zgartirishingiz mumkin.

source: ml
ru: мл

source: of %1$d ml
ru: из %1$d мл
uz: %1$d ml dan
